{"url":"http://www.huffingtonpost.com/entry/joel-osteen-lakewood-church-houston-harvey_us_59a6ac7fe4b084581a148cef?section=us_us-news","source":"www.huffingtonpost.com","article":{},"article_key":"b8304989c784f6ad39d9ef42aae1de92485dd515","title":"Joel Osteen Says Megachurch Didn't Open Earlier Because Houston 'Didn't Ask'","body":"The pastor came under fire for not initially opening Lakewood Church to flood victims.Pastor Joel Osteen can’t seem to get his story straight about why he didn’t offer his 16,800-seat megachurch in Houston as a shelter sooner for those displaced by Hurricane Harvey.During an appearance on NBC’s “TODAY” show Wednesday, the head of Lakewood Church said its doors have “always been open.” Minutes later, he appeared to reverse course and admit that the church hadn’t initially encouraged victims to seek shelter there.“If people were here, they’d realize there were safety issues,” Osteen said during the TV appearance. “We were just being precautious, but the main thing is the city didn’t ask us to become a shelter then.”Dozens of Houston-area churches, Lakewood Church, however, posted on Sunday that the building was “inaccessible” due to flooding and encouraged people to seek shelter elsewhere.After backlash mounted on social media, a spokesman for the church announced Tuesday that it was prepared to shelter displaced people ― “once the cities and county shelters reach capacity.”When asked if he would done anything differently to avoid the onslaught of criticism aimed at him on social media over the last few days, Osteen said he would.“Yeah, I’m sure we would have done something differently,” Osteen said. But he added: “The fact is I don’t know that we would have opened any sooner, because again there were safety issues.”And he continued to put the onus on city officials, claiming Lakewood Church would have offered shelter had it been asked.“It’s easy to say, ‘Wow, there’s that building. They’re not using it.’ But we don’t have volunteers,” Osteen said. “We don’t have staff that could get here. We’re all about helping the city whenever we could ― if they would have asked us to become a shelter early on, we would have prepared for it.”"}
