{"url":"http://www.breitbart.com/texas/2017/08/28/joel-osteens-lakewood-church-closes-doors-displaced-harvey-victims/","source":"www.breitbart.com","article":{"title":"Joel Osteen’s Lakewood Church Closes Doors to Displaced Harvey Victims","body":["HOUSTON, Texas — Joel Osteen is facing a public relations nightmare as his 17,000-seat facility, Lakewood Church, is keeping doors closed during the overwhelming crisis caused by Hurricane Harvey.","Osteen and his wife, Victoria, are pastors of the non-denominational congregation located in the former Compaq Center. Lakewood Church is situated roughly six miles from downtown Houston and is on Highway 59 which has arteries to and from the Interstate 610 Loop, Interstate 45, and Highway 288.","The Compaq Center was home to the Houston Rockets and hosted other events prior to the campus being acquired by Osteen’s church.","After the tropical storm and hurricane rocked the city on Friday, Osteen tweeted, “Victoria & I are praying for everyone affected by Hurricane Harvey. Please join us as we pray for the safety of our Texas friends & family.”","The response to Osteen’s request to have others join he and his wife in prayer for the flood and hurricane victims was met with instant ridicule and criticism on Twitter. Here are some responses in Twitter Moments ","Even another clergyman, Pastor Greg Locke, tweeted, “Joel Osteen, as a Pastor you have a huge obligation to show the love of Christ at this very moment.”","Melissa G @Isserella tweeted this:","Here is a screenshot of a few other responses to Osteen’s Tweet requesting that others join him and his wife in prayer.","Twitter sensation Terrence Williams ","The Twitter video sensation told viewers he was from the South and that those in New York, Utah, the East Coast, and the West Coast, and other places in the country did not need to tell him what to say about the church closing its doors. He said people in Houston were dying and needed a place to stay. “This is about southern folks right now!”","Osteen tweeted earlier Monday afternoon, “Our hearts break as we see the damage and destruction in our city. Please join us in helping Houston recover.”","The tweet contains a “Hurricane Relief Update,” and a link with a message that stated:","A Tweet by the pastor eleven hours earlier said, “Jesus promises us peace that passes understanding. That’s peace when it doesn’t make sense.”","On Sunday the Houston pastor Tweeted, “God’s got this.”","Twitter users took photos of the building calling out Osteen and the church showing that it was not flooded, nor was the area around the church apparently affected.","A video posted by a self-proclaimed fan of Osteen’s reveals the roadways in front of the church are open and not flooded. Twitter user ","Facebook user Jorge Colmenares posted additional proof of roads to the church being passable.","Those on Twitter also tweeted what are supposed to be photos of Joel Osteen’s mansion in Houston’s River Oaks, a few miles away.","Breitbart Texas has provided continual coverage of the aftermath of the tropical storm and the Category 1-4 hurricane that has spread havoc in Houston and around coastal Texas. Tens of thousands have been displaced from their homes in the Bayou City and at least eight people have died.","Follow complete coverage of ","Editor’s Note: This article has been updated with additonal information.","Lana Shadwick"]},"topic_id":"b8304989c784f6ad39d9ef42aae1de92485dd515","article_id":"832421828c5dd299f52e6d0c997ef698612cc0ec"}
