{"url":"http://www.cnn.com/2017/08/29/us/joel-osteen-houston-megachurch-criticism/index.html","source":"www.cnn.com","article":{"title":"Joel Osteen says church has opened doors to flood victims","body":["The megachurch led by Joel Osteen is receiving people who need shelter and also helping evacuees with supplies such as baby food, formula and other shelter needs, the church announced via Twitter Tuesday morning. ","Lakewood Church was under fire after apparently not opening up the church to flood victims. The church disputed online criticism, stating \"we are prepared to shelter people once the cities and county shelters reach capacity.\" ","\"Victoria and I care deeply about our fellow Houstonians. Lakewood's doors are open and we are receiving anyone who needs shelter,\" Osteen tweeted Tuesday, referencing his wife who is also Lakewood's co-pastor.","Opinion: Osteen's Harvey excuses are bogus","On Monday, a few hundred people arrived to the church in buses, Donald Iloff, church spokesman, told CNN's Erin Burnett.","Lakewood Church, which was founded by Osteen's father in the 1950s, had posted on social media Monday that the venue was \"inaccessible due to severe flooding\" following Hurricane Harvey, which has been downgraded to a tropical storm.","Photos provided by the church showed standing water in hallways and the parking lot. The church already had a flood wall in place following a previous storm. The church occupies the former home of the NBA's Houston Rockets. ","Iloff said there were safety concerns about potential flooding. The bottom floor of the building flooded eight feet during Tropical Storm Alison in 2001 and they had safety concerns of what might happen if they sheltered people in the building, he said. ","\"When it floods, it floods in a torrent. And it floods quickly. We installed flood gates, but you know, you have to have a lot of faith in those if you are going to put a lot of people into the building.  ","\"So we had concerns, you know. From the very beginning as far as the safety of people in this building and that was too great a concern for us,\" he said. ","Many on social media had blasted the church for not taking people in.","\"The Twitter critics don't determine who we are or what we do,\" Iloff said in response to the scathing social media's opinions. \"We're going to act as we should act. They have nothing to do with our mission.\" ","The church also disputed the backlash. ","\"We have never closed our doors. We will continue to be a distribution center for those in need,\" according to a statement from Lakewood Church. ","At least several hundred people can be housed on the second floor of the church, Iloff said.","The area around the church flooded on Monday, Iloff said, and at least three people had come that day to the church for help before they were taken to the George Brown Convention Center.","Houston officials ","Nine people have died as a result of the catastrophic storm."]},"topic_id":"b8304989c784f6ad39d9ef42aae1de92485dd515","article_id":"d70f29d40e028133c712de8ae519036e1ee4444f"}
